// window.addEventListener('DOMContentLoaded', () => {
const nextCourseDate = '10.01.2024';
const langArr = {
    "main-title": {
        "ua": "Онлайн курси польської мови!",
        "ru": "Онлайн курсы польского языка!",
    },
    "courses": {
        "ua": "Курси",
        "ru": "Курсы",
    },
    "level": {
        "ua": "Дізнайся свій рівень",
        "ru": "Узнай свой уровень",
    },
    "title": {
        "ua": "Онлайн курси польської мови!",
        "ru": "Онлайн курсы польского языка!",
    },
    "descr1": {
        "ua": "Допоможемо тобі не тільки у вивченні польської мови, а й у досягненні результату в найближчі терміни.",
        "ru": "Поможем тебе не только в изучении польского языка, но и в достижении результата в ближайшие сроки.",
    },
    "descr2": {
        "ua": "Записуйся на безкоштовну консультацію!",
        "ru": "Записывайся на бесплатную консультацию!",
    },
    "descr3": {
        "ua": `Старт нового курсу - ${nextCourseDate}`,
        "ru": `Cтарт нового курса - ${nextCourseDate}`,
    },
    "consultation-signing": {
        "ua": "Записатися на консультацію",
        "ru": "Записаться на консультацию",
    },
    "course-signing": {
        "ua": "Записатися на курс",
        "ru": "Записаться на курс",
    },
    "why-us-title": {
        "ua": "Чому ми ?",
        "ru": "Почему мы ?",
    },
    "why-us-descr": {
        "ua": "Ми надаємо унікальні заняття з досвідченими викладачами в невеликих групах. Наші курси розроблені дипломованими фахівцями та орієнтовані на практичне застосування мови. Учні можуть брати участь у розмовному клубі, а також мають доступ до польських фільмів на Netflix із цікавими завданнями. Ми допомагаємо досягати мовних і кар'єрних цілей. Приєднуйтесь до нас і відкрийте для себе новий світ можливостей!",
        "ru": "Мы предоставляем уникальные занятия с опытными преподавателями в небольших группах. Наши курсы разработаны дипломированными специалистами и ориентированы на практическое применение языка. Ученики могут участвовать в разговорном клубе, а также имеют доступ к польским фильмам на Netflix с интересными заданиями. Мы помогаем достигать языковых и карьерных целей. Присоединяйтесь к нам и откройте для себя новый мир возможностей!",
    },
    "why-us-one": {
        "ua": "Заняття з викладачем",
        "ru": "Занятия с преподавателем",
    },
    "why-us-two": {
        "ua": "Інтерактивна платформа",
        "ru": "Интерактивная платформа",
    },
    "why-us-three": {
        "ua": "Мікс/гібридний графік",
        "ru": "Mикс/гибридный график",
    },
    "why-us-four": {
        "ua": "Сучасна програма",
        "ru": "Современная программа",
    },
    "platform-title": {
        "ua": "Наша платформа",
        "ru": "Наша платформа",
    },
    "platform-descr": {
        "ua": "Тут ви знайдете різноманітні тематичні завдання, а також отримаєте доступ до великих освітніх матеріалів. Вчіться зручно та ефективно, де б ви не знаходилися! Навчання проходить на інтерактивній платформі edvibe.com",
        "ru": "Здесь вы найдете различные тематические задания, а также получите доступ к обширным образовательным материалам. Учитесь удобно и эффективно, где бы вы ни находились! Обучение проходит на интерактивной платформе edvibe.com",
    },
    "free-lesson": {
        "ua": "Спробувати безкоштовний урок",
        "ru": "Попробовать бесплатный урок",
    },
    "courses-title": {
        "ua": "Наші курси",
        "ru": "Наши курсы",
    },
    "courses-descr": {
        "ua": "Якщо ви не впевнені у виборі курсу, запишіться на безкоштовну діагностику",
        "ru": "Если вы не уверены в выборе курса, запишитесь на бесплатную диагностику",
    },
    "courses-pomowimy-descr": {
        "ua": "Для тих хто хоче займатися у вільному графіку і більше практикуватися",
        "ru": "Для тех кто хочет заниматься в свободном графике и больше практиковаться",
    },
    "courses-pomowimy-points--one": {
        "ua": "Особистий кабінет на платформі",
        "ru": "Личный кабинет на платформе",
    },
    "courses-pomowimy-points--two": {
        "ua": "Конспекти до кожного заняття",
        "ru": "Конспекты к каждому занятию",
    },
    "courses-pomowimy-points--three": {
        "ua": "Доступ до ігор та Quizlet карток",
        "ru": "Доступ к играм и Quizlet карточкам",
    },
    "courses-pomowimy-points--four": {
        "ua": "Розмовний клуб",
        "ru": "Pазговорный клуб",
    },
    "courses-pomowimy-points--five": {
        "ua": "Підписка на Netflix, c завданнями до серіалів",
        "ru": "Подписка на Netflix, c заданиями к сериалам",
    },
    "courses-button-one": {
        "ua": "Записатися",
        "ru": "Записаться",
    },
    "courses-one": {
        "ua": "Курс А0-А1",
        "ru": "Курс А0-А1",
    },
    "courses-one-descr": {
        "ua": "Для тих хто хоче почати вивчення польської мови",
        "ru": "Для тех кто хочет начать изучение польского языка",
    },
    "courses-one-points--one": {
        "ua": "Навчання 3.5 місяці (15 тижнів)",
        "ru": "Обучение 3.5 месяца (15 недель)",
    },
    "courses-one-points--two": {
        "ua": "Особистий кабінет на платформі",
        "ru": "Личный кабинет на платформе",
    },
    "courses-one-points--three": {
        "ua": "Доступ до записів всіх занять",
        "ru": "Доступ к записям всех занятий",
    },
    "courses-one-points--four": {
        "ua": "Щоденні завдання",
        "ru": "Ежедневные задания",
    },
    "courses-one-points--five": {
        "ua": "Доступ до спільного чату в Telegram",
        "ru": "Доступ к общему чату в Telegram",
    },
    "courses-one-points--six": {
        "ua": "Розмовний клуб",
        "ru": "Pазговорный клуб",
    },
    "courses-one-points--seven": {
        "ua": "3 сесії з коучем",
        "ru": "3 сессии с коучем",
    },
    "courses-one-points--eight": {
        "ua": "Підписка на Netflix, c завданнями до серіалів",
        "ru": "Подписка на Netflix, c заданиями к сериалам",
    },
    "courses-one-secondary-descr--one": {
        "ua": "*у разі запису до курсу А2 - 440 зл/місяць",
        "ru": "*при записи до курса А2 - 440 зл/месяц",
    },
    "courses-one-secondary-descr--two": {
        "ua": "*у разі запису до курсу В1 - 399 зл/місяць",
        "ru": "*при записи до курса В1 - 399 зл/месяц",
    },
    "courses-button-two": {
        "ua": "Записатися",
        "ru": "Записаться",
    },
    "courses-two": {
        "ua": "Курс А1-А2",
        "ru": "Курс А1-А2",
    },
    "courses-two-descr": {
        "ua": "Для тих хто хоче займатися у вільному графіку і більше практикуватися",
        "ru": "Для тех кто хочет заниматься в свободном графике и больше практиковаться",
    },
    "courses-two-points--one": {
        "ua": "Навчання 3.5 місяці (15 тижнів)",
        "ru": "Обучение 3.5 месяца (15 недель)",
    },
    "courses-two-points--two": {
        "ua": "Особистий кабінет на платформі",
        "ru": "Личный кабинет на платформе",
    },
    "courses-two-points--three": {
        "ua": "Доступ до записів всіх занять",
        "ru": "Доступ к записям всех занятий",
    },
    "courses-two-points--four": {
        "ua": "Щоденні завдання",
        "ru": "Ежедневные задания",
    },
    "courses-two-points--five": {
        "ua": "Доступ до спільного чату в Telegram",
        "ru": "Доступ к общему чату в Telegram",
    },
    "courses-two-points--six": {
        "ua": "Розмовний клуб",
        "ru": "Pазговорный клуб",
    },
    "courses-two-points--seven": {
        "ua": "3 сесії з коучем",
        "ru": "3 сессии с коучем",
    },
    "courses-two-points--eight": {
        "ua": "Підписка на Netflix, c завданнями до серіалів",
        "ru": "Подписка на Netflix, c заданиями к сериалам",
    },
    "courses-button-three": {
        "ua": "Записатися",
        "ru": "Записаться",
    },
    "courses-three": {
        "ua": "Курс A2-B1",
        "ru": "Курс A2-B1",
    },
    "courses-three-descr": {
        "ua": "Для тих хто хоче займатися у вільному графіку і більше практикуватися",
        "ru": "Для тех кто хочет заниматься в свободном графике и больше практиковаться",
    },
    "courses-three-points--one": {
        "ua": "Навчання 2 місяці (8 тижнів)",
        "ru": "Обучение 2 месяца (8 недель)",
    },
    "courses-three-points--two": {
        "ua": "Особистий кабінет на платформі",
        "ru": "Личный кабинет на платформе",
    },
    "courses-three-points--three": {
        "ua": "Доступ до записів всіх занять",
        "ru": "Доступ к записям всех занятий",
    },
    "courses-three-points--four": {
        "ua": "Щоденні завдання",
        "ru": "Ежедневные задания",
    },
    "courses-three-points--five": {
        "ua": "Доступ до спільного чату в Telegram",
        "ru": "Доступ к общему чату в Telegram",
    },
    "courses-three-points--six": {
        "ua": "Розмовний клуб",
        "ru": "Pазговорный клуб",
    },
    "courses-three-points--seven": {
        "ua": "2 сесії з коучем",
        "ru": "2 сессии с коучем",
    },
    "courses-three-points--eight": {
        "ua": "Підписка на Netflix, c завданнями до серіалів",
        "ru": "Подписка на Netflix, c заданиями к сериалам",
    },
    "courses-button-four": {
        "ua": "Записатися",
        "ru": "Записаться",
    },
    "team-title": {
        "ua": "Наша команда",
        "ru": "Наша команда",
    },
    "team-descr": {
        "ua": "Наші викладачі - це команда грамотних дипломованих фахівців у світі вивчення польської мови. Індивідуальний підхід і чуйність - це те, що відрізняє нас. Ми по-справжньому прагнемо передати знання нашим учням. Наше завдання - надихати вас протягом усього шляху до вільного володіння польською мовою.",
        "ru": "Наши преподаватели – это команда грамотных дипломированных специалистов в мире изучения польского языка. Индивидуальный подход и отзывчивость – это то, что отличает нас. Мы по-настоящему стремимся передать знания нашим учащимся. Наша задача - вдохновлять вас на протяжении всего пути к свободному владению польским языком.",
    },
    "certificate-title": {
        "ua": "Сертифікат",
        "ru": "Сертификат",
    },
    "certificate-descr": {
        "ua": "Після успішного проходження курсу кожен студент отримує сертифікат. Вдосконалюйте свої навички з нами та отримайте сертифікат, що підтверджує вашу експертизу в польській мові!",
        "ru": "После успешного прохождения курса каждый студент получает сертификат. Совершенствуйте свои навыки с нами и получите сертификат подтверждающий вашу экспертизу в польском языке!",
    },
    "reviews-title": {
        "ua": "Відгуки",
        "ru": "Отзывы",
    },
    "reviews-descr": {
        "ua": "Відгуки про нашу школу - це серце і душа нашої діяльності. Вони відіграють важливу роль, допомагаючи нам постійно вдосконалювати якість навчання наших студентів.",
        "ru": "Отзывы о нашей школе - это сердце и душа нашей деятельности. Они играют важную роль, помогая нам постоянно совершенствовать качество обучения наших студентов.",
    },
    "reviews-one": {
        "ua": "Все супер, все подобається) Встигла позайматися ще з двома вчителями з вашої школи - і кожна просто топ❤️✅ Це дуже круто, що крім уроків польської є можливість ще щось нове для себе відкрити. Рекомендую.",
        "ru": "Всё супер, всё нравится) Успела позаниматься ещё с двумя учителями из вашей школы - и каждая просто топ❤️✅ Это очень круто, что кроме уроков польского есть возможность ещё что-то новое для себя открыть. Рекомендую.",
    },
    "reviews-two": {
        "ua": "Продовжую навчатися, помічаю прогрес у дрібницях побутових. Спікінг клаб дуже допомагає) Наш учитель Поліна відмінно знає матеріал і легко пояснює ті речі, які я не могла зрозуміти в інших вчителів. Школу я рекомендую. Планую продовжувати.",
        "ru": "Продолжаю обучаться, замечаю прогресс в мелочах бытовых. Спикинг клаб очень помогает) Наш учитель Полина отлично знает материал и легко объясняет те вещи, которые я не могла понять у других учителей. Школу я рекомендую. Планирую продолжать.",
    },
    "reviews-three": {
        "ua": "Я задоволена процесом навчання в школі. Матеріал цікавий, онлайн-платформа дає змогу зручно з ним працювати. Окремої згадки заслуговує можливість дивитися серіали на Netflix і потім виконувати за ними завдання.",
        "ru": "Я довольна процессом обучения в школе. Материал интересный, онлайн-платформа позволяет удобно с ним работать. Отдельного упоминания заслуживает возможность смотреть сериалы на Netflix и затем выполнять по ним задания.",
    },
    "reviews-four": {
        "ua": "Дуже переживала, що буду відставати від дітей, але в нас склалася комфортна обстановка. З кожним заняттям збільшувався інтерес, тому що були інтерактиви. Прикольна платформа для залучення.",
        "ru": "Очень переживала, что буду отставать от ребят, но у нас сложилась комфортная обстановка. С каждым занятием увеличивался интерес, потому что были интерактивы. Прикольная вовлекающая платформа.",
    },
    "contact-title": {
        "ua": "Зв'язатися з нами",
        "ru": "Связаться с нами",
    },
    "contact-name": {
        "ua": "Ім'я",
        "ru": "Имя",
    },
    "contact-surname": {
        "ua": "Прізвище",
        "ru": "Фамилия",
    },
    "contact-phone": {
        "ua": "Номер телефону",
        "ru": "Номер телефона",
    },
    "contact-choice": {
        "ua": "Оберіть курс:",
        "ru": "Выберите курс:",
    },
    "contact-choice-level": {
        "ua": "Дізнайся свій рівень/Безкоштовна діагностика",
        "ru": "Узнай свой уровень/Бесплатная диагностика",
    },
    "contact-choice-consultation": {
        "ua": "Консультація",
        "ru": "Консультация",
    },
    "contact-message": {
        "ua": "Ваше повідомлення",
        "ru": "Ваше сообщение",
    },
    "contact-policy": {
        "ua": "Я приймаю",
        "ru": "Я принимаю",
    },
    "contact-policy-link": {
        "ua": "політику оброблення даних",
        "ru": "политику обработки данных",
    },
    "contact-button": {
        "ua": "Відправити заявку",
        "ru": "Отправить заявку",
    },
    "contact-popup": {
        "ua": "Дякуємо за довіру! Ми зв'яжемося з Вами найближчим часом.",
        "ru": "Спасибо за доверие! Мы свяжемся с Вами в ближайшее время.",
    },
    "quiz-name": {
        "ua": "Пройти квіз і підібрати найкращий курс польської",
        "ru": "Пройти квиз и подобрать лучший курс польского",
    },
    "quiz-descr": {
        "ua": "Почни змінювати своє життя разом з нами!",
        "ru": "Начни менять свою жизнь вместе с нами!",
    },
    "why-us-burger": {
        "ua": "Чому ми ?",
        "ru": "Почему мы ?",
    },
    "platform-burger": {
        "ua": "Наша платформа",
        "ru": "Наша платформа",
    },
    "courses-burger": {
        "ua": "Наші курси",
        "ru": "Наши курсы",
    },
    "team-burger": {
        "ua": "Наша команда",
        "ru": "Наша команда",
    },
    "reviews-burger": {
        "ua": "Відгуки",
        "ru": "Отзывы",
    },
    "contact-burger": {
        "ua": "Зв'язатися з нами",
        "ru": "Связаться с нами",
    },
}

// });
